### Merging the feature spaces of Sentinel 2 and VHR (TRIPLESAT)

#### Load the libraries we'll need
* **`datetime`** to transform column names that include dates
* **`pandas`** for dataframe handling
* **`numpy`** for fast numeric operations
* **`os`** for various interactions with the system, like safely joining paths

In [198]:
from datetime import datetime
import pandas as pd
import numpy as np
import os

#### Load the 2 tiny csv files
We are initially using tiny versions of the feature spaces to make experimentations faster and easier to interpret. They are called tiny because I've only kept the header and 4 rows selected in such way that the following transformations apply.

In [199]:
s2 = pd.read_csv('s2_tiny.csv', index_col='id')
triplesat = pd.read_csv('triplesat_tiny.csv', index_col='id')

The Sentinel-2 feature space, comes with a column that serves no purpose. It's called "Unnamed: 0" and it is probably a problem to be fixed on the corresponding Sentinel-2 scripts. But we don't need it, and thus, if it exists we can drop it.

In [200]:
# There is a weird 'Unnamed: 0' column in the S2 feature space.
# Check if it does exist, and drop it in that case.
if s2.columns[0] == 'Unnamed: 0':
    s2.drop(s2.columns[[0]], axis=1, inplace=True)
    print('Column "Unnamed: 0" was found in the S2 feature space and was dropped')
else:
    print('No unnecessary columns found in the S2 feature space')

Column "Unnamed: 0" was found in the S2 feature space and was dropped

#### Preview the 2 dataframes
Here is what the Sentinel-2 feature space looks like:

In [201]:
s2

,B02_83,B03_83,B04_83,B05_83,B06_83,B07_83,B08_83,B8A_83,B11_83,B12_83,...,B05_323,B06_323,B07_323,B08_323,B8A_323,B11_323,B12_323,NDVI_323,NDWI_323,PSRI_323
id,,,,,,,,,,,,,,,,,,,,,
1,641.72500,864.30000,845.65000,1357.5000,2244.7500,2450.5000,2696.8500,2781.9250,2414.0250,1630.35000,...,692.0294,1330.0588,1542.3235,1584.0000,1773.4117,986.9706,497.70587,721.106362,232.219458,63.752166
2,533.67303,807.45890,594.94867,1276.6349,3062.9340,3494.6025,3803.0308,3658.7068,1890.4912,1142.17300,...,1327.0361,2876.8618,3196.4983,3424.3948,3436.9473,1614.1431,916.92430,711.118775,359.281152,13.986358
114,431.49600,671.66930,381.00266,1058.1627,3252.2827,3945.4026,4224.0293,4221.4720,1969.8480,963.95200,...,1022.8000,3456.4294,4139.4640,4360.7200,4439.6533,1651.4694,793.55730,889.965538,450.626289,-1.115608
115,427.12122,665.34436,374.91183,1038.9724,3196.0828,3882.8430,4205.0576,4145.3115,1932.2837,951.36365,...,1002.4270,3274.5178,3926.6860,4134.6997,4189.2670,1560.3279,756.06335,882.495777,452.038512,-3.138859

And the triplesat feature space:

In [202]:
triplesat

,20170923094819_BLUE,20170923094819_GREEN,20170923094819_RED,20170923094819_NIR,20170923094822_BLUE,20170923094822_GREEN,20170923094822_RED,20170923094822_NIR
id,,,,,,,,
9,680.00000,442.5000,281.500,775.5000,NaN,NaN,NaN,NaN
10,161.50000,114.5000,71.500,180.0000,NaN,NaN,NaN,NaN
114,684.11730,560.9813,343.232,1246.4426,681.9089,558.08310,339.71313,1223.90080
115,713.56665,584.2889,372.550,1219.1888,528.8184,429.26816,271.10614,943.94415

#### Keep the common bands
As we can see above, we have many more columns in the Sentinel-2 feature space (572) than in the Triplesat feature space (8). This is expected and is caused by 2 reasons:
* We have 13 features for each Sentinel-1 acquisition, while 4 for each Triplesat acquisition
* The Sentinel-2 feature space comes from many acquisitions instead of just 2 which is the number of Triplesat acquisitions (used in this analysis)

There are 4 common bands between the 2 satellite sensors that correspond to the Blue, Green, Red and Near-Infrared wavelengths. According to these pages [for Sentinel-2](https://hatarilabs.com/ih-en/how-many-spectral-bands-have-the-sentinel-2-images) and [for Triplesat](https://www.satimagingcorp.com/satellite-sensors/triplesat-satellite/), the mapping is as follows:

| S2 Band | 3SAT Band | Name |
|---|:---:|:---|
|B02|1|Blue|
|B03|2|Green|
|B04|3|Red|
|B08|4|NIR|

We can initially see that the S2 columns are named after the convention `BAND_DOY`, where:
* `BAND` is the Sentinel-2 band, ie. `B02, B03, B04, ...`
* `DOY` is the day of year

In order to make the 2 dataframes compatible, we have to transform the column names so that they are using the same convention. It makes sense to do it in the following way:
* Keep only the S2 columns that have a corresponding 3SAT value, ie. `B02, B03, B04, B08`
* Convert the S2 names to actual band names (Blue, Green, Red, NIR)
* Convert the 3SAT dates to the day of year format

#### Keep the 4 Sentinel-2 bands
Let's create a list of the columns we want to keep.

In [203]:
# A column list with the S2 bands that we can keep
s2_columns = [col for col in s2.columns if
                col.startswith('B02') or
                col.startswith('B03') or
                col.startswith('B04') or
                col.startswith('B08')]

# Now only keep these columns
s2 = s2[s2_columns]
print('Columns that are incompatible for 1st-level fusion have been dropped from the S2 feature space')

Columns that are incompatible for 1st-level fusion have been dropped from the S2 feature space

And after keeping only them, here is how the Sentinel-2 feature space looks like.

In [204]:
s2

,B02_83,B03_83,B04_83,B08_83,B02_86,B03_86,B04_86,B08_86,B02_116,B03_116,...,B04_313,B08_313,B02_321,B03_321,B04_321,B08_321,B02_323,B03_323,B04_323,B08_323
id,,,,,,,,,,,,,,,,,,,,,
1,641.72500,864.30000,845.65000,2696.8500,484.82500,742.30000,761.97500,2546.2500,1832.888900,2062.389000,...,289.315296,1882.2800,171.88235,290.79413,256.67648,1584.0000,171.88235,290.79413,256.67648,1584.0000
2,533.67303,807.45890,594.94867,3803.0308,375.64460,675.77264,494.36835,3726.8777,520.222200,784.628970,...,337.406560,2651.8856,241.50075,490.36255,273.02080,2490.5960,537.88983,850.35364,578.12665,3424.3948
114,431.49600,671.66930,381.00266,4224.0293,282.40268,539.32800,277.84268,4347.9040,362.838672,669.807998,...,402.208000,4853.5894,213.37334,453.96533,201.47200,3720.4534,257.73868,569.61600,253.88266,4360.7200
115,427.12122,665.34436,374.91183,4205.0576,279.27548,523.16530,272.29752,4284.7656,324.868445,628.654975,...,417.366400,4637.2890,236.15977,510.01376,227.40771,4135.9116,268.36365,560.20660,258.08540,4134.6997

#### Rename S2 band columns
To keep a common naming convention between S2 and TripleSat, it makes sense to convert the first part of the S2 band names to the Name, as seen on the table shared above. Thus:
* `B02` â†’ `BLUE`
* `B03` â†’ `GREEN`
* `B04` â†’ `RED`
* `B08` â†’ `NIR`

In [205]:
# Replace each of the patterns
s2.columns = s2.columns.str.replace('B02','BLUE')
s2.columns = s2.columns.str.replace('B03','GREEN')
s2.columns = s2.columns.str.replace('B04','RED')
s2.columns = s2.columns.str.replace('B08','NIR')

This is how the S2 dataframe looks like after renaming

In [206]:
s2

,BLUE_83,GREEN_83,RED_83,NIR_83,BLUE_86,GREEN_86,RED_86,NIR_86,BLUE_116,GREEN_116,...,RED_313,NIR_313,BLUE_321,GREEN_321,RED_321,NIR_321,BLUE_323,GREEN_323,RED_323,NIR_323
id,,,,,,,,,,,,,,,,,,,,,
1,641.72500,864.30000,845.65000,2696.8500,484.82500,742.30000,761.97500,2546.2500,1832.888900,2062.389000,...,289.315296,1882.2800,171.88235,290.79413,256.67648,1584.0000,171.88235,290.79413,256.67648,1584.0000
2,533.67303,807.45890,594.94867,3803.0308,375.64460,675.77264,494.36835,3726.8777,520.222200,784.628970,...,337.406560,2651.8856,241.50075,490.36255,273.02080,2490.5960,537.88983,850.35364,578.12665,3424.3948
114,431.49600,671.66930,381.00266,4224.0293,282.40268,539.32800,277.84268,4347.9040,362.838672,669.807998,...,402.208000,4853.5894,213.37334,453.96533,201.47200,3720.4534,257.73868,569.61600,253.88266,4360.7200
115,427.12122,665.34436,374.91183,4205.0576,279.27548,523.16530,272.29752,4284.7656,324.868445,628.654975,...,417.366400,4637.2890,236.15977,510.01376,227.40771,4135.9116,268.36365,560.20660,258.08540,4134.6997

#### Rename band columns to a common convention
It will be good to convert the columns of the feature spaces following a common convention.
* The Sentinel-2 acquisitions, as already mentioned, follow the `BAND_DOY` convention
* The Triplesat acquisitions use names of the form `YYYYMMDDHHMMSS_BAND`

We will use the **`DOY_BAND`** convention so that later on, the columns will be sorted alphanumerically into an order that makes temporal sense. The `DOY` (Day Of Year) part will use preceding zeroes where needed (001-365/6), which means that the actual order will be "enforced" regardless of the number of non-zero digits.

#### Datetime conversion utility function
For the purpose of converting the date part of the columns into the output format we wish, let's create a utility function

In [207]:
# Utility function to convert date strings between datetime formats
# Arguments:
#   1. in_str
#   2. in_format
#   3. out_format
# Returns:
#      The date converted to the out_format (as a string)
#
def convert_date_string(in_str, in_format, out_format):
    # Initially convert input string to datetime object
    in_str = datetime.strptime(in_str, in_format)
    
    # Then, return it as a string again, after converting it to the out_format
    # This could also be a one-liner but it wouldn't be easily readable
    return in_str.strftime(out_format)

#### Rename TripleSAT columns to the common convention
The TripleSAT format of the date part of the column names is `YYYYMMDDhhmmss` which in python code translates to `%Y%m%d%H%M%S`

In [208]:
triplesat_date_in_format = '%Y%m%d%H%M%S'
triplesat_date_out_format = '%j'
new_colnames = []
for col in triplesat.columns:
    # separate the date and band parts of the triplesat column names
    date_part = col.split('_')[0]
    band_part = col.split('_')[1]

    new_date = convert_date_string(date_part, triplesat_date_in_format, triplesat_date_out_format)
    # convert to the output format by calling the utility function
    new_colnames.append('{0}_{1}'.format(new_date,band_part))

# Now assign the new names to the 3SAT columns
triplesat.columns = new_colnames

#### Rename Sentinel-2 columns to the common convention
We also want to make sure that instead of `BAND_DOY` we convert the sentinel-2 columns to `DOY_BAND`.

In [209]:
s2_date_in_format = '%j'
s2_date_out_format = '%j'
new_colnames = []
for col in s2.columns:
    # separate the date and band parts of the sentinel 2 column names
    date_part = col.split('_')[1]
    band_part = col.split('_')[0]

    new_date = convert_date_string(date_part, s2_date_in_format, s2_date_out_format)
    # convert to the output format by calling the utility function
    new_colnames.append('{0}_{1}'.format(new_date,band_part))

# Now assign the new names to the 3SAT columns
s2.columns = new_colnames

Here is how the feature spaces now look like. This is Sentinel-2 after conversion:

In [210]:
s2

,083_BLUE,083_GREEN,083_RED,083_NIR,086_BLUE,086_GREEN,086_RED,086_NIR,116_BLUE,116_GREEN,...,313_RED,313_NIR,321_BLUE,321_GREEN,321_RED,321_NIR,323_BLUE,323_GREEN,323_RED,323_NIR
id,,,,,,,,,,,,,,,,,,,,,
1,641.72500,864.30000,845.65000,2696.8500,484.82500,742.30000,761.97500,2546.2500,1832.888900,2062.389000,...,289.315296,1882.2800,171.88235,290.79413,256.67648,1584.0000,171.88235,290.79413,256.67648,1584.0000
2,533.67303,807.45890,594.94867,3803.0308,375.64460,675.77264,494.36835,3726.8777,520.222200,784.628970,...,337.406560,2651.8856,241.50075,490.36255,273.02080,2490.5960,537.88983,850.35364,578.12665,3424.3948
114,431.49600,671.66930,381.00266,4224.0293,282.40268,539.32800,277.84268,4347.9040,362.838672,669.807998,...,402.208000,4853.5894,213.37334,453.96533,201.47200,3720.4534,257.73868,569.61600,253.88266,4360.7200
115,427.12122,665.34436,374.91183,4205.0576,279.27548,523.16530,272.29752,4284.7656,324.868445,628.654975,...,417.366400,4637.2890,236.15977,510.01376,227.40771,4135.9116,268.36365,560.20660,258.08540,4134.6997

And this is Triplesat after conversion:

In [211]:
triplesat

,266_BLUE,266_GREEN,266_RED,266_NIR,266_BLUE,266_GREEN,266_RED,266_NIR
id,,,,,,,,
9,680.00000,442.5000,281.500,775.5000,NaN,NaN,NaN,NaN
10,161.50000,114.5000,71.500,180.0000,NaN,NaN,NaN,NaN
114,684.11730,560.9813,343.232,1246.4426,681.9089,558.08310,339.71313,1223.90080
115,713.56665,584.2889,372.550,1219.1888,528.8184,429.26816,271.10614,943.94415

#### Multiple acquisitions per day of year
For the particular VHR acquisitions we are using, we notice that the column names are repetitive as they are of the same day of year. This is normal and it is a result of:
* the acquisitions being indeed of the same day (covering different areas with a small time difference of a few seconds)
* there is a small area containing parcels that is captured by both acquisitions (overlapping part of acquisitions)

We want to have only 1 value per day, and maybe the most obvious way is to abide by the following rules:
1. If all acquisitions (2 in this demo) are `NaN`, then the result is `NaN`
2. If `0<n<all` acquistions have values, then keep the average (`sum/n`), where `sum` is the sum of the non-`NaN` values.

There is a caveat for keeping the average of multiple acquisitions though. Some parcels in the edges of acquisitions have very small values. This is because of the acquisition-edges being black, which means that some or all of the parcel pixels are also black. So there are cases were a parcel is covered by 1 acquisition properly, but is on the very edge of the other. Thus, we may have a zonal statistic value of NIR 700 for example because of acquisition 1, and a NIR value of 20 because of acquisition 2 having many black pixels.

This is something that we need to take into account. There are 2 ways to handle it that initially come to mind:
1. Find the acquisition with the **highest** value and compare that value with the rest. If the other values have a difference of more than 5% (so they are smaller by more than 5%), then throw them away and calculate the mean with the rest.
2. Find the acquisition with the **highest** value and **_keep that one only_**.

In fact, later on, it might be a good idea to merge values further so that we have groups of wider timeframes. For example, instead of having 1 value per day, we could (and probably should) group values further and have 1 for every 5 days, or for a week or even more.

As we have to decide the way to move forward, we consider for the moment that the best option for these cases of overlaps is option 2. Thus, keep the highest value. This looks like the safest option that makes sure there is no unwanted skew coming from the average calculation.

#### Step 1: Prepare metadata to identify single and duplicate colnames
We will keep some data for each of the columns. That will be the name, and then, for each name, we will also keep the column indices of appearance. Duplicates will, thus, be the ones with more than 1 indices.

In [212]:
def prepareFusionMetadata(dataset):
    # We want each name once, so let's make it a set
    duplicate_colnames = set()
    # Get the dataset column names
    col_list = list(dataset.columns)

    # current is a helper variable for tranversing the columns
    # col_indexes is a dictionary which, for every column name with duplicates
    current = 0
    col_indexes = {}
    # Iterate on the dataset column names to find duplicates
    for col in col_list:
        # Add the column name in the dictionary if it doesn't already exist
        # together with the index of appearance
        if col not in col_indexes.keys():
            col_indexes[col] = [current]
        # otherwise, if it's already there, only add the current index of appearance
        else:
            col_indexes[col].append(current)

        # If a column that has not already been checked, find out if it appears more than once
        if col not in duplicate_colnames and col_list.count(col) > 1:
            # add it to the set of duplicates
            duplicate_colnames.add(col)

        current += 1

    dup_length = len(duplicate_colnames)
    if dup_length == 0:
        print('No duplicate columns.')
    elif dup_length%4 == 0:
        print('Length of the duplicate column names ({0}) is divisible by 4, which looks good.'.format(dup_length))
    else:
        print('Length of the duplicate column names ({0}) is not divisible by 4. Worth investigating this case')

    return col_indexes

colIndexes = prepareFusionMetadata(triplesat)

Length of the duplicate column names (4) is divisible by 4, which looks good.

Let's see what are the column names together with their appearance indexes:

In [213]:
print("Column\t\tIndexes")
for item in colIndexes:
    print('{0}:\t {1}'.format(item,colIndexes[item]))

Column		Indexes
266_BLUE:	 [0, 4]
266_GREEN:	 [1, 5]
266_RED:	 [2, 6]
266_NIR:	 [3, 7]

#### Step 2: Transverse through the columns and keep the appropriate values

We will now create a new dataframe:
1. As a starting point, the index is copied from the original to the new dataframe
2. For each column name, we are checking the indices that they appear in
  * unique columns appear once, so they have only 1 index, ie. unique acquisition for a single day
  * more than one indices indicate cases where we have overlapping areas and, thus, multiple acquisitions per day
3. We append the maximum value between the available values or NaN if all acquisitions are NaN

In [196]:
# Create the new dataframe and start by copying the index column from the original
df3s = pd.DataFrame(index=triplesat.index)

for item in colIndexes:
    # Get the corresponding columns only to a new dataframe
    print("Working on column: {0}".format(item))
    if len(colIndexes[item]) > 1:
        print(' ... more than 1 columns with this name, keeping the max values')
    temp_df = triplesat.iloc[:,colIndexes[item]]

    # Now insert the max values for each row of these columns into the new df
    df3s.insert(
        loc=len(df3s.columns),
        column=item,
        value=list(triplesat.iloc[:,colIndexes[item]].max(axis=1).values)
    )

Working on column: 266_BLUE
 ... more than 1 columns with this name, keeping the max values
Working on column: 266_GREEN
 ... more than 1 columns with this name, keeping the max values
Working on column: 266_RED
 ... more than 1 columns with this name, keeping the max values
Working on column: 266_NIR
 ... more than 1 columns with this name, keeping the max values

By now, we should have managed to bring the VHR dataset into a fuse-ready state. Here is it is:

In [197]:
df3s

      266_BLUE  266_GREEN  266_RED    266_NIR
id
9    680.00000   442.5000  281.500   775.5000
10   161.50000   114.5000   71.500   180.0000
114  684.11730   560.9813  343.232  1246.4426
115  713.56665   584.2889  372.550  1219.1888

### Merging VHR dataset with S2 dataset
So now that we have both the **S2** and the **3SAT** VHR datasets into a common format, we can merge them together.

In [214]:
triplesat_colIndexes = prepareFusionMetadata(df3s)
s2_colIndexes = prepareFusionMetadata(s2)

No duplicate columns.
No duplicate columns.

In [217]:
# check if any column appears in both dataframes
# thus, if we have same-day acquisition for both
# S2 and triplesat
if any([x in list(s2_colIndexes.keys()) for x in list(triplesat_colIndexes.keys())]):
    print('There is at least one day for which we have acquisitions from both satellites')
else:
    print('There is no common acquisition from the 2 satellites in these datasets')

There is at least one day for which we have acquisitions from both satellites

In [216]:
s2_colIndexes

{'083_BLUE': [0],
 '083_GREEN': [1],
 '083_RED': [2],
 '083_NIR': [3],
 '086_BLUE': [4],
 '086_GREEN': [5],
 '086_RED': [6],
 '086_NIR': [7],
 '116_BLUE': [8],
 '116_GREEN': [9],
 '116_RED': [10],
 '116_NIR': [11],
 '126_BLUE': [12],
 '126_GREEN': [13],
 '126_RED': [14],
 '126_NIR': [15],
 '146_BLUE': [16],
 '146_GREEN': [17],
 '146_RED': [18],
 '146_NIR': [19],
 '153_BLUE': [20],
 '153_GREEN': [21],
 '153_RED': [22],
 '153_NIR': [23],
 '156_BLUE': [24],
 '156_GREEN': [25],
 '156_RED': [26],
 '156_NIR': [27],
 '188_BLUE': [28],
 '188_GREEN': [29],
 '188_RED': [30],
 '188_NIR': [31],
 '191_BLUE': [32],
 '191_GREEN': [33],
 '191_RED': [34],
 '191_NIR': [35],
 '198_BLUE': [36],
 '198_GREEN': [37],
 '198_RED': [38],
 '198_NIR': [39],
 '201_BLUE': [40],
 '201_GREEN': [41],
 '201_RED': [42],
 '201_NIR': [43],
 '203_BLUE': [44],
 '203_GREEN': [45],
 '203_RED': [46],
 '203_NIR': [47],
 '216_BLUE': [48],
 '216_GREEN': [49],
 '216_RED': [50],
 '216_NIR': [51],
 '218_BLUE': [52],
 '218_GREEN': [53],
 '218_RED': [54],
 '218_NIR': [55],
 '221_BLUE': [56],
 '221_GREEN': [57],
 '221_RED': [58],
 '221_NIR': [59],
 '223_BLUE': [60],
 '223_GREEN': [61],
 '223_RED': [62],
 '223_NIR': [63],
 '226_BLUE': [64],
 '226_GREEN': [65],
 '226_RED': [66],
 '226_NIR': [67],
 '231_BLUE': [68],
 '231_GREEN': [69],
 '231_RED': [70],
 '231_NIR': [71],
 '233_BLUE': [72],
 '233_GREEN': [73],
 '233_RED': [74],
 '233_NIR': [75],
 '236_BLUE': [76],
 '236_GREEN': [77],
 '236_RED': [78],
 '236_NIR': [79],
 '238_BLUE': [80],
 '238_GREEN': [81],
 '238_RED': [82],
 '238_NIR': [83],
 '241_BLUE': [84],
 '241_GREEN': [85],
 '241_RED': [86],
 '241_NIR': [87],
 '243_BLUE': [88],
 '243_GREEN': [89],
 '243_RED': [90],
 '243_NIR': [91],
 '246_BLUE': [92],
 '246_GREEN': [93],
 '246_RED': [94],
 '246_NIR': [95],
 '253_BLUE': [96],
 '253_GREEN': [97],
 '253_RED': [98],
 '253_NIR': [99],
 '256_BLUE': [100],
 '256_GREEN': [101],
 '256_RED': [102],
 '256_NIR': [103],
 '258_BLUE': [104],
 '258_GREEN': [105],
 '258_RED': [106],
 '258_NIR': [107],
 '263_BLUE': [108],
 '263_GREEN': [109],
 '263_RED': [110],
 '263_NIR': [111],
 '266_BLUE': [112],
 '266_GREEN': [113],
 '266_RED': [114],
 '266_NIR': [115],
 '268_BLUE': [116],
 '268_GREEN': [117],
 '268_RED': [118],
 '268_NIR': [119],
 '271_BLUE': [120],
 '271_GREEN': [121],
 '271_RED': [122],
 '271_NIR': [123],
 '276_BLUE': [124],
 '276_GREEN': [125],
 '276_RED': [126],
 '276_NIR': [127],
 '278_BLUE': [128],
 '278_GREEN': [129],
 '278_RED': [130],
 '278_NIR': [131],
 '281_BLUE': [132],
 '281_GREEN': [133],
 '281_RED': [134],
 '281_NIR': [135],
 '286_BLUE': [136],
 '286_GREEN': [137],
 '286_RED': [138],
 '286_NIR': [139],
 '288_BLUE': [140],
 '288_GREEN': [141],
 '288_RED': [142],
 '288_NIR': [143],
 '291_BLUE': [144],
 '291_GREEN': [145],
 '291_RED': [146],
 '291_NIR': [147],
 '296_BLUE': [148],
 '296_GREEN': [149],
 '296_RED': [150],
 '296_NIR': [151],
 '303_BLUE': [152],
 '303_GREEN': [153],
 '303_RED': [154],
 '303_NIR': [155],
 '308_BLUE': [156],
 '308_GREEN': [157],
 '308_RED': [158],
 '308_NIR': [159],
 '311_BLUE': [160],
 '311_GREEN': [161],
 '311_RED': [162],
 '311_NIR': [163],
 '313_BLUE': [164],
 '313_GREEN': [165],
 '313_RED': [166],
 '313_NIR': [167],
 '321_BLUE': [168],
 '321_GREEN': [169],
 '321_RED': [170],
 '321_NIR': [171],
 '323_BLUE': [172],
 '323_GREEN': [173],
 '323_RED': [174],
 '323_NIR': [175]}

#### Remove the single day columns on S2 that already exist on Triplesat
As we want to initially experiment on the enhancements through fusion of S2 and VHR data, and as we happen to already have day 266 of 2017 on S2, we will drop the 4 corresponding columns.

In [218]:
s2 = s2.drop(['266_BLUE', '266_GREEN', '266_RED', '266_NIR'], axis=1)

And then, let's re-create the `s2_colIndexes` dictionary:

In [86]:
# Create the new dataframe and start by copying the index column from one of the
# originals. Doesn't matter if it is S2 or triplesat as they share the same index
fused = pd.DataFrame(index=df3s.index)

for item in colIndexes:
    # Get the corresponding columns only to a new dataframe
    print("Working on column: {0}".format(item))
    if len(colindexes[item]) > 1:
        print(' ... more than 1 columns with this name, keeping the max values')
    temp_df = triplesat.iloc[:,colindexes[item]]

    # Now insert the max values for each row of these columns into the new df
    df3s.insert(
        loc=len(df3s.columns),
        column=item,
        value=list(triplesat.iloc[:,colindexes[item]].max(axis=1).values)
    )

266_BLUE
[0, 4]
266_GREEN
[1, 5]
266_RED
[2, 6]
266_NIR
[3, 7]

In [104]:
triplesat.iloc[:,[0,4]]

      266_BLUE  266_BLUE
id
9    680.00000       NaN
10   161.50000       NaN
114  684.11730  681.9089
115  713.56665  528.8184

In [109]:
list(triplesat.iloc[:,[0,4]].max(axis=1).values)

[680.0, 161.5, 684.1173, 713.56665]